NickEngmann/Jackp0t/Firmware/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
    kPIN_MUX_DirectionInput = 0U,        /* Input direction */
    kPIN_MUX_DirectionOutput = 1U,       /* Output direction */
    kPIN_MUX_DirectionInputOrOutput = 2U /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define SOPT5_LPUART0RXSRC_LPUART_RX 0x00u /*!<@brief LPUART0 Receive Data Source Select: LPUART_RX pin */
#define SOPT5_LPUART0TXSRC_LPUART_TX 0x00u /*!<@brief LPUART0 Transmit Data Source Select: LPUART0_TX pin */

/*! @name PORTC6 (coord B4), LED_nINT
  @{ */
#define BOARD_INITPINS_LED_nINT_PERIPHERAL GPIOC                  /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_LED_nINT_SIGNAL GPIO                       /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_LED_nINT_GPIO GPIOC                        /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_LED_nINT_GPIO_PIN 6U                       /*!<@brief PORTC pin index: 6 */
#define BOARD_INITPINS_LED_nINT_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_LED_nINT_PIN 6U                            /*!<@brief PORTC pin index: 6 */
#define BOARD_INITPINS_LED_nINT_CHANNEL 6                         /*!<@brief GPIOC GPIO channel: 6 */
#define BOARD_INITPINS_LED_nINT_PIN_NAME PTC6                     /*!<@brief Pin name */
#define BOARD_INITPINS_LED_nINT_LABEL "LED_nINT"                  /*!<@brief Label */
#define BOARD_INITPINS_LED_nINT_NAME "LED_nINT"                   /*!<@brief Identifier name */
#define BOARD_INITPINS_LED_nINT_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PORTB0 (coord D6), SCL
  @{ */
#define BOARD_INITPINS_SCL_PERIPHERAL I2C0   /*!<@brief Device name: I2C0 */
#define BOARD_INITPINS_SCL_SIGNAL SCL        /*!<@brief I2C0 signal: SCL */
#define BOARD_INITPINS_SCL_PORT PORTB        /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_SCL_PIN 0U            /*!<@brief PORTB pin index: 0 */
#define BOARD_INITPINS_SCL_PIN_NAME I2C0_SCL /*!<@brief Pin name */
#define BOARD_INITPINS_SCL_LABEL "SCL"       /*!<@brief Label */
#define BOARD_INITPINS_SCL_NAME "SCL"        /*!<@brief Identifier name */
                                             /* @} */

/*! @name PORTB1 (coord C6), SDA
  @{ */
#define BOARD_INITPINS_SDA_PERIPHERAL I2C0   /*!<@brief Device name: I2C0 */
#define BOARD_INITPINS_SDA_SIGNAL SDA        /*!<@brief I2C0 signal: SDA */
#define BOARD_INITPINS_SDA_PORT PORTB        /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_SDA_PIN 1U            /*!<@brief PORTB pin index: 1 */
#define BOARD_INITPINS_SDA_PIN_NAME I2C0_SDA /*!<@brief Pin name */
#define BOARD_INITPINS_SDA_LABEL "SDA"       /*!<@brief Label */
#define BOARD_INITPINS_SDA_NAME "SDA"        /*!<@brief Identifier name */
                                             /* @} */

/*! @name PORTC5 (coord A5), LED_EN
  @{ */
#define BOARD_INITPINS_LED_EN_PERIPHERAL GPIOC                   /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_LED_EN_SIGNAL GPIO                        /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_LED_EN_GPIO GPIOC                         /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_LED_EN_GPIO_PIN 5U                        /*!<@brief PORTC pin index: 5 */
#define BOARD_INITPINS_LED_EN_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_LED_EN_PIN 5U                             /*!<@brief PORTC pin index: 5 */
#define BOARD_INITPINS_LED_EN_CHANNEL 5                          /*!<@brief GPIOC GPIO channel: 5 */
#define BOARD_INITPINS_LED_EN_PIN_NAME PTC5                      /*!<@brief Pin name */
#define BOARD_INITPINS_LED_EN_LABEL "LED_EN"                     /*!<@brief Label */
#define BOARD_INITPINS_LED_EN_NAME "LED_EN"                      /*!<@brief Identifier name */
#define BOARD_INITPINS_LED_EN_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                 /* @} */

/*! @name PORTD7 (coord A2), PTD7
  @{ */
/*!
 * @brief Device name: n/a */
#define BOARD_INITPINS_PTD7_PERIPHERAL n/a
/*!
 * @brief n/a signal: disabled */
#define BOARD_INITPINS_PTD7_SIGNAL disabled
/*!
 * @brief PORT device name: PORTD */
#define BOARD_INITPINS_PTD7_PORT PORTD
/*!
 * @brief PORTD pin index: 7 */
#define BOARD_INITPINS_PTD7_PIN 7U
/*!
 * @brief Pin name */
#define BOARD_INITPINS_PTD7_PIN_NAME PTD7/SPI1_MISO/LPUART0_TX/I2C1_SCL/SPI1_MOSI/FXIO0_D7
/*!
 * @brief Label */
#define BOARD_INITPINS_PTD7_LABEL "PTD7"
/*!
 * @brief Identifier name */
#define BOARD_INITPINS_PTD7_NAME "PTD7"
/* @} */

/*! @name PORTC4 (coord A6), NXH_nRESET
  @{ */
#define BOARD_INITPINS_NXH_nRESET_PERIPHERAL GPIOC                   /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_NXH_nRESET_SIGNAL GPIO                        /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_NXH_nRESET_GPIO GPIOC                         /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_NXH_nRESET_GPIO_PIN 4U                        /*!<@brief PORTC pin index: 4 */
#define BOARD_INITPINS_NXH_nRESET_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_NXH_nRESET_PIN 4U                             /*!<@brief PORTC pin index: 4 */
#define BOARD_INITPINS_NXH_nRESET_CHANNEL 4                          /*!<@brief GPIOC GPIO channel: 4 */
#define BOARD_INITPINS_NXH_nRESET_PIN_NAME PTC4                      /*!<@brief Pin name */
#define BOARD_INITPINS_NXH_nRESET_LABEL "NXH_nRESET"                 /*!<@brief Label */
#define BOARD_INITPINS_NXH_nRESET_NAME "NXH_nRESET"                  /*!<@brief Identifier name */
#define BOARD_INITPINS_NXH_nRESET_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                     /* @} */

/*! @name PORTE22 (coord E1), KL_TX
  @{ */
#define BOARD_INITPINS_KL_TX_PERIPHERAL UART2  /*!<@brief Device name: UART2 */
#define BOARD_INITPINS_KL_TX_SIGNAL TX         /*!<@brief UART2 signal: TX */
#define BOARD_INITPINS_KL_TX_PORT PORTE        /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_KL_TX_PIN 22U           /*!<@brief PORTE pin index: 22 */
#define BOARD_INITPINS_KL_TX_PIN_NAME UART2_TX /*!<@brief Pin name */
#define BOARD_INITPINS_KL_TX_LABEL "KL_TX"     /*!<@brief Label */
#define BOARD_INITPINS_KL_TX_NAME "KL_TX"      /*!<@brief Identifier name */
                                               /* @} */

/*! @name PORTE23 (coord F1), KL_RX
  @{ */
#define BOARD_INITPINS_KL_RX_PERIPHERAL UART2  /*!<@brief Device name: UART2 */
#define BOARD_INITPINS_KL_RX_SIGNAL RX         /*!<@brief UART2 signal: RX */
#define BOARD_INITPINS_KL_RX_PORT PORTE        /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_KL_RX_PIN 23U           /*!<@brief PORTE pin index: 23 */
#define BOARD_INITPINS_KL_RX_PIN_NAME UART2_RX /*!<@brief Pin name */
#define BOARD_INITPINS_KL_RX_LABEL "KL_RX"     /*!<@brief Label */
#define BOARD_INITPINS_KL_RX_NAME "KL_RX"      /*!<@brief Identifier name */
                                               /* @} */

/*! @name PORTC3 (coord B5), NXH_REFCLK
  @{ */
#define BOARD_INITPINS_NXH_REFCLK_PERIPHERAL SIM     /*!<@brief Device name: SIM */
#define BOARD_INITPINS_NXH_REFCLK_SIGNAL CLKOUT      /*!<@brief SIM signal: CLKOUT */
#define BOARD_INITPINS_NXH_REFCLK_PORT PORTC         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_NXH_REFCLK_PIN 3U             /*!<@brief PORTC pin index: 3 */
#define BOARD_INITPINS_NXH_REFCLK_PIN_NAME CLKOUT    /*!<@brief Pin name */
#define BOARD_INITPINS_NXH_REFCLK_LABEL "NXH_REFCLK" /*!<@brief Label */
#define BOARD_INITPINS_NXH_REFCLK_NAME "NXH_REFCLK"  /*!<@brief Identifier name */
                                                     /* @} */

/*! @name PORTA1 (coord F4), NXH_RX
  @{ */
#define BOARD_INITPINS_NXH_RX_PERIPHERAL LPUART0  /*!<@brief Device name: LPUART0 */
#define BOARD_INITPINS_NXH_RX_SIGNAL RX           /*!<@brief LPUART0 signal: RX */
#define BOARD_INITPINS_NXH_RX_PORT PORTA          /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_NXH_RX_PIN 1U              /*!<@brief PORTA pin index: 1 */
#define BOARD_INITPINS_NXH_RX_PIN_NAME LPUART0_RX /*!<@brief Pin name */
#define BOARD_INITPINS_NXH_RX_LABEL "NXH_RX"      /*!<@brief Label */
#define BOARD_INITPINS_NXH_RX_NAME "NXH_RX"       /*!<@brief Identifier name */
                                                  /* @} */

