NickEngmann/Jackp0t/Firmware/board/pin_mux.h
/*! @name PORTA2 (coord E4), NXH_TX
  @{ */
#define BOARD_INITPINS_NXH_TX_PERIPHERAL LPUART0  /*!<@brief Device name: LPUART0 */
#define BOARD_INITPINS_NXH_TX_SIGNAL TX           /*!<@brief LPUART0 signal: TX */
#define BOARD_INITPINS_NXH_TX_PORT PORTA          /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_NXH_TX_PIN 2U              /*!<@brief PORTA pin index: 2 */
#define BOARD_INITPINS_NXH_TX_PIN_NAME LPUART0_TX /*!<@brief Pin name */
#define BOARD_INITPINS_NXH_TX_LABEL "NXH_TX"      /*!<@brief Label */
#define BOARD_INITPINS_NXH_TX_NAME "NXH_TX"       /*!<@brief Identifier name */
                                                  /* @} */

/*! @name PORTC7 (coord A4), NXH_DETECT
  @{ */
#define BOARD_INITPINS_NXH_DETECT_PERIPHERAL GPIOC                  /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_NXH_DETECT_SIGNAL GPIO                       /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_NXH_DETECT_GPIO GPIOC                        /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_NXH_DETECT_GPIO_PIN 7U                       /*!<@brief PORTC pin index: 7 */
#define BOARD_INITPINS_NXH_DETECT_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_NXH_DETECT_PIN 7U                            /*!<@brief PORTC pin index: 7 */
#define BOARD_INITPINS_NXH_DETECT_CHANNEL 7                         /*!<@brief GPIOC GPIO channel: 7 */
#define BOARD_INITPINS_NXH_DETECT_PIN_NAME PTC7                     /*!<@brief Pin name */
#define BOARD_INITPINS_NXH_DETECT_LABEL "NXH_DETECT"                /*!<@brief Label */
#define BOARD_INITPINS_NXH_DETECT_NAME "NXH_DETECT"                 /*!<@brief Identifier name */
#define BOARD_INITPINS_NXH_DETECT_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                    /* @} */

/*! @name PORTC2 (coord B6), NXH_CAL
  @{ */
#define BOARD_INITPINS_NXH_CAL_PERIPHERAL GPIOC                   /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_NXH_CAL_SIGNAL GPIO                        /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_NXH_CAL_GPIO GPIOC                         /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_NXH_CAL_GPIO_PIN 2U                        /*!<@brief PORTC pin index: 2 */
#define BOARD_INITPINS_NXH_CAL_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_NXH_CAL_PIN 2U                             /*!<@brief PORTC pin index: 2 */
#define BOARD_INITPINS_NXH_CAL_CHANNEL 2                          /*!<@brief GPIOC GPIO channel: 2 */
#define BOARD_INITPINS_NXH_CAL_PIN_NAME PTC2                      /*!<@brief Pin name */
#define BOARD_INITPINS_NXH_CAL_LABEL "NXH_CAL"                    /*!<@brief Label */
#define BOARD_INITPINS_NXH_CAL_NAME "NXH_CAL"                     /*!<@brief Identifier name */
#define BOARD_INITPINS_NXH_CAL_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                  /* @} */

/*! @name PORTC1 (coord C5), NXH_UPDATE
  @{ */
#define BOARD_INITPINS_NXH_UPDATE_PERIPHERAL GPIOC                   /*!<@brief Device name: GPIOC */
#define BOARD_INITPINS_NXH_UPDATE_SIGNAL GPIO                        /*!<@brief GPIOC signal: GPIO */
#define BOARD_INITPINS_NXH_UPDATE_GPIO GPIOC                         /*!<@brief GPIO device name: GPIOC */
#define BOARD_INITPINS_NXH_UPDATE_GPIO_PIN 1U                        /*!<@brief PORTC pin index: 1 */
#define BOARD_INITPINS_NXH_UPDATE_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_INITPINS_NXH_UPDATE_PIN 1U                             /*!<@brief PORTC pin index: 1 */
#define BOARD_INITPINS_NXH_UPDATE_CHANNEL 1                          /*!<@brief GPIOC GPIO channel: 1 */
#define BOARD_INITPINS_NXH_UPDATE_PIN_NAME PTC1                      /*!<@brief Pin name */
#define BOARD_INITPINS_NXH_UPDATE_LABEL "NXH_UPDATE"                 /*!<@brief Label */
#define BOARD_INITPINS_NXH_UPDATE_NAME "NXH_UPDATE"                  /*!<@brief Identifier name */
#define BOARD_INITPINS_NXH_UPDATE_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                     /* @} */

/*! @name PORTA4 (coord F5), BOOTCFG0
  @{ */
#define BOARD_INITPINS_BOOTCFG0_PERIPHERAL n/a                        /*!<@brief Device name: n/a */
#define BOARD_INITPINS_BOOTCFG0_SIGNAL disabled                       /*!<@brief n/a signal: disabled */
#define BOARD_INITPINS_BOOTCFG0_PORT PORTA                            /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_BOOTCFG0_PIN 4U                                /*!<@brief PORTA pin index: 4 */
#define BOARD_INITPINS_BOOTCFG0_PIN_NAME PTA4/I2C1_SDA/TPM0_CH1/NMI_b /*!<@brief Pin name */
#define BOARD_INITPINS_BOOTCFG0_LABEL "BOOTCFG0"                      /*!<@brief Label */
#define BOARD_INITPINS_BOOTCFG0_NAME "BOOTCFG0"                       /*!<@brief Identifier name */
                                                                      /* @} */

/*! @name PORTD4 (coord A3), KL_PIEZO
  @{ */
#define BOARD_INITPINS_KL_PIEZO_PERIPHERAL TPM0                    /*!<@brief Device name: TPM0 */
#define BOARD_INITPINS_KL_PIEZO_SIGNAL CH                          /*!<@brief TPM0 signal: CH */
#define BOARD_INITPINS_KL_PIEZO_PORT PORTD                         /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_KL_PIEZO_PIN 4U                             /*!<@brief PORTD pin index: 4 */
#define BOARD_INITPINS_KL_PIEZO_CHANNEL 4                          /*!<@brief TPM0 channel: 4 */
#define BOARD_INITPINS_KL_PIEZO_PIN_NAME TPM0_CH4                  /*!<@brief Pin name */
#define BOARD_INITPINS_KL_PIEZO_LABEL "KL_PIEZO"                   /*!<@brief Label */
#define BOARD_INITPINS_KL_PIEZO_NAME "KL_PIEZO"                    /*!<@brief Identifier name */
#define BOARD_INITPINS_KL_PIEZO_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                                   /* @} */

/*! @name PORTA20 (coord D5), KL_nRESET
  @{ */
#define BOARD_INITPINS_KL_nRESET_PERIPHERAL RCM    /*!<@brief Device name: RCM */
#define BOARD_INITPINS_KL_nRESET_SIGNAL RESET      /*!<@brief RCM signal: RESET */
#define BOARD_INITPINS_KL_nRESET_PORT PORTA        /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_KL_nRESET_PIN 20U           /*!<@brief PORTA pin index: 20 */
#define BOARD_INITPINS_KL_nRESET_PIN_NAME RESET_b  /*!<@brief Pin name */
#define BOARD_INITPINS_KL_nRESET_LABEL "KL_nRESET" /*!<@brief Label */
#define BOARD_INITPINS_KL_nRESET_NAME "KL_nRESET"  /*!<@brief Identifier name */
                                                   /* @} */

/*! @name PORTA3 (coord E5), KL_SWDIO
  @{ */
#define BOARD_INITPINS_KL_SWDIO_PERIPHERAL SWD   /*!<@brief Device name: SWD */
#define BOARD_INITPINS_KL_SWDIO_SIGNAL DIO       /*!<@brief SWD signal: DIO */
#define BOARD_INITPINS_KL_SWDIO_PORT PORTA       /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_KL_SWDIO_PIN 3U           /*!<@brief PORTA pin index: 3 */
#define BOARD_INITPINS_KL_SWDIO_PIN_NAME SWD_DIO /*!<@brief Pin name */
#define BOARD_INITPINS_KL_SWDIO_LABEL "KL_SWDIO" /*!<@brief Label */
#define BOARD_INITPINS_KL_SWDIO_NAME "KL_SWDIO"  /*!<@brief Identifier name */
                                                 /* @} */

/*! @name PORTA0 (coord F3), KL_SWCLK
  @{ */
#define BOARD_INITPINS_KL_SWCLK_PERIPHERAL SWD   /*!<@brief Device name: SWD */
#define BOARD_INITPINS_KL_SWCLK_SIGNAL CLK       /*!<@brief SWD signal: CLK */
#define BOARD_INITPINS_KL_SWCLK_PORT PORTA       /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_KL_SWCLK_PIN 0U           /*!<@brief PORTA pin index: 0 */
#define BOARD_INITPINS_KL_SWCLK_PIN_NAME SWD_CLK /*!<@brief Pin name */
#define BOARD_INITPINS_KL_SWCLK_LABEL "KL_SWCLK" /*!<@brief Label */
#define BOARD_INITPINS_KL_SWCLK_NAME "KL_SWCLK"  /*!<@brief Identifier name */
                                                 /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
